---
kind: property
id: P:Autodesk.Revit.DB.Visual.SolidGlass.SolidglassColorByObject
source: html/5d5c02ad-dd3e-978e-0296-2c36ff6031ec.htm
---
# Autodesk.Revit.DB.Visual.SolidGlass.SolidglassColorByObject Property

The property labeled "Custom Color" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public static string SolidglassColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".